/*
Реалізувати введеня даних та всі можливі провірки сторон будинків да сторін ділянки.
*/


#include<iostream>
#include<Windows.h>
using namespace std;


void main()
{
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);

	int a, b, p, q, r, s;

	int S, s1, s2;//S(ділянка), s1(буд.1), s2(буд.2)

	cout << "Введіть сторону ділянки a: ";
	cin >> a;

	cout << "Введіть сторону ділянки b: ";
	cin >> b;


	cout << "Введіть сторону першого будинку p: ";
	cin >> p;

	cout << "Введіть сторону першого будинку q: ";
	cin >> q;

	if ((p <= a) && (p <= b) && (q <= a) && (q <= b))
	{
		cout << "Введіть сторону другого будинку r: ";
		cin >> r;

		cout << "Введіть сторону другого будинку s: ";
		cin >> s;


		if ((r <= a) && (r <= b) && (s <= a) && (s <= b))
		{
			if ((q + p <= a) && (q + p <= b) && (p + r <= a) && (p + r <= b))//провірка будинків на перетинання між собою
			{
				S = a * b;
				s1 = p * q;
				s2 = r * s;
				if (S - s1 - s2 >= 0)//перевірка на вмістимість будинків на ділянці
				{
					cout << "Можна поставити будинки на цій ділянці " << endl;
				}
				else
				{
					cout << "Не можна поставити будинки на цій ділянці " << endl;
				}
			}
			else
			{
				cout << "Будинки не можуть перетинатись один з одним " << endl;
			}
		}

		else
		{
			cout << "Довжина сторона будинка2 перевищує довжина сторони ділянки  " << endl;
		}
	}
	else
	{
		cout << "Довжина сторона будинка1 перевищує довжина сторони ділянки  " << endl;
	}



	system("pause");
	return;
}
