/*Постановка задачи
На прямокутний паралелепіпед (a × b × H) поставили конус з радіусом R та висотою H, поєднавши вісь симетрії фігур.
*/


#include<iostream>
#include<Windows.h> // директива препроцесора для підтримки кирилиці в консолі  
#include <cmath>
#ifndef M_PI
#define M_PI 3.14 // визначення символічної числової константи M_PI 
#endif
using namespace std;


void main()
{
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);


	float R, H;
	double Vcone, Scir; // cone(конус), circle(коло)

				// введення даних    
	cout << "Введіть радіус циліндра: ";
	cin >> R;
	cout << "Введіть висоту циліндра: ";
	cin >> H;

	// обчислення площі кола   
	Scir = M_PI * R * R;
	//cout << "Площа кола: " << Scir << endl;
	Vcone = (Scir * H) / 3;// обчислення об'єму циліндра   

	// виведення результату    
	/*cout << "Об’єм циліндра з радіусом " << R << " и висотою " << H;
	cout << " дорівнює: " << Vcone << endl;*/


	// обчислення об’єму прямокутного паралелепіпеда


	float a, b;
	double Vrect; // rectangle(прямокутник)

				 // введення даних
	cout << "Введіть ширину прямокутного паралелепіпеда: ";
	cin >> a;
	cout << "Введіть довжину прямокутного паралелепіпеда: ";
	cin >> b;


	// обчислення об'єму прямокутного паралелепіпеда
	Vrect = a * b * H;

	/*cout << "Об’єм прямокутного паралелепіпеда з довжиною " << a << " шириною " << b << " и висотою " << H;
	cout << " дорівнює: " << Vrect << endl;*/

	double Vall;

	Vall = Vcone + Vrect;
	cout << "Об’єм всієї фігури " << Vall << endl;




										/*знаходження повної площи заданої фігури*/


	double Slat; //lateral(бічна)

	//Формула площі бічної поверхні
	Slat = M_PI * R * (sqrt(H * H + R * R));

	/*cout << "Площа бічної поверхні конуса з твірною " << L << " дорівнює: " << Slat << endl;*/

	//Формула площі кола
	Scir = M_PI * R * R;


	double  S1, S2, S3; // [S1, S2, S3]-площа сторон паралелепіпеда

	//Формули знаходження плоші сторін паралелепіпеда
	S1 = 2 * a * H;
	S2 = 2 * b * H;
	S3 = a * b;

	/*cout << "Площа перших паралельних сторін дорівнює: " << S1 << " , двух інших: " << S2 << " і нижньої дорівнює: " << S3 << endl;*/

	double sAll, sdif; // All (все), difference(різниця)

	sdif = Scir - S3;
	/*cout << "Різниця площадей" << sdif << endl;*/

	sAll = Slat + S1 + S2 + S3 + sdif;

	cout << "Площа повної фігури дорівнює: " << sAll << endl;


	system("pause");
	return;


}